micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr.h
/** @defgroup PWR_PIN_Polarity PWR Pin Polarity configuration
  * @{
  */
#define PWR_PIN_POLARITY_HIGH          (0x0U)
#define PWR_PIN_POLARITY_LOW           (0x1U)
/**
  * @}
  */

/** @defgroup PWR_PIN_Pull PWR Pin Pull configuration
  * @{
  */
#define PWR_PIN_NO_PULL                (0x0U)
#define PWR_PIN_PULL_UP                (0x1U)
#define PWR_PIN_PULL_DOWN              (0x2U)
/**
  * @}
  */

/** @defgroup PWR_Wakeup_Pins_Flags PWR Wakeup Pins Flags.
  * @{
  */
#define PWR_WAKEUP_FLAG1               PWR_WKUPSR_WKUPF1                       /*!< Wakeup flag on PA0  */
#define PWR_WAKEUP_FLAG2               PWR_WKUPSR_WKUPF2                       /*!< Wakeup flag on PA2  */
#define PWR_WAKEUP_FLAG3               PWR_WKUPSR_WKUPF3                       /*!< Wakeup flag on PC13 */
#define PWR_WAKEUP_FLAG4               PWR_WKUPSR_WKUPF4                       /*!< Wakeup flag on PD2  */

#define PWR_WAKEUP_FLAG_ALL           (PWR_WKUPSR_WKUPF1 | PWR_WKUPSR_WKUPF2 |\
                                       PWR_WKUPSR_WKUPF3 | PWR_WKUPSR_WKUPF4)
/**
  * @}
  */

/** @defgroup PWR_Items PWR Items
  * @{
  */

/* Use the PWR_SECCFGR bits definition offset for both Secure and Privilege because
   it is the same offset value for the same item */
#define PWR_ITEM_0                     PWR_SECCFGR_SEC0                        /*!< System supply configuration secure/privilege protection       */
#define PWR_ITEM_1                     PWR_SECCFGR_SEC1                        /*!< Programmable voltage detector secure/privilege protection     */
#define PWR_ITEM_2                     PWR_SECCFGR_SEC2                        /*!< VDDCORE monitor secure/privilege protection                   */
#define PWR_ITEM_3                     PWR_SECCFGR_SEC3                        /*!< TCM and FLEXMEM low power control secure/privilege protection */
#define PWR_ITEM_4                     PWR_SECCFGR_SEC4                        /*!< Voltage scaling selection secure/privilege protection         */
#define PWR_ITEM_5                     PWR_SECCFGR_SEC5                        /*!< Backup domain secure/privilege protection                     */
#define PWR_ITEM_6                     PWR_SECCFGR_SEC6                        /*!< CPU power control secure/privilege protection                 */
#define PWR_ITEM_7                     PWR_SECCFGR_SEC7                        /*!< Peripheral voltage monitor secure/privilege protection        */
#define PWR_ITEM_WKUP1                 PWR_SECCFGR_WKUPSEC1                    /*!< WKUP1 pin secure/privilege protection                         */
#define PWR_ITEM_WKUP2                 PWR_SECCFGR_WKUPSEC2                    /*!< WKUP2 pin secure/privilege protection                         */
#define PWR_ITEM_WKUP3                 PWR_SECCFGR_WKUPSEC3                    /*!< WKUP3 pin secure/privilege protection                         */
#define PWR_ITEM_WKUP4                 PWR_SECCFGR_WKUPSEC4                    /*!< WKUP4 pin secure/privilege protection                         */

#define PWR_ITEM_ALL                   (PWR_ITEM_0 | PWR_ITEM_1 | PWR_ITEM_2 | PWR_ITEM_3 | PWR_ITEM_4 | PWR_ITEM_5 | \
                                        PWR_ITEM_6 | PWR_ITEM_7 | PWR_ITEM_WKUP1 | PWR_ITEM_WKUP2 | PWR_ITEM_WKUP3 | \
                                        PWR_ITEM_WKUP4)
/**
  * @}
  */

/** @defgroup PWR_Attributes PWR Attributes
  * @brief PWR Privilege/NPrivilege and Secure/NSecure Attributes
  * @{
  */
/* Defines attribute */
#define PWR_ITEM_ATTR_NSEC_PRIV_MASK   (0x10U)                                 /*!< NSecure Privilege / NPrivilege attribute item mask */
#define PWR_ITEM_ATTR_SEC_PRIV_MASK    (0x20U)                                 /*!< Secure Privilege / NPrivilege attribute item mask  */

#define PWR_NSEC_PRIV                  (PWR_ITEM_ATTR_NSEC_PRIV_MASK | 0x01U)  /*!< NSecure and Privileged attribute  */
#define PWR_NSEC_NPRIV                 PWR_ITEM_ATTR_NSEC_PRIV_MASK            /*!< NSecure and NPrivileged attribute */
#define PWR_SEC_PRIV                   (PWR_ITEM_ATTR_SEC_PRIV_MASK  | 0x02U)  /*!< Secure and Privileged attribute   */
#define PWR_SEC_NPRIV                  PWR_ITEM_ATTR_SEC_PRIV_MASK             /*!< Secure and NPrivileged attribute  */
/**
  * @}
  */

/** @defgroup PWR_Flag PWR Status Flags
  *        Elements values convention: 0000 00XX XXXX XXXY YYYYb
  *           -      Y YYYY : Flag position in the XXX register (5 bits)
  *           - XX XXXX XXX : Status register (9 bits)
  *             - 000000001: CR2    register
  *             - 000000010: VOSCR  register
  *             - 000000100: CR3    register
  *             - 000001000: BDCR1  register
  *             - 000010000: CPUCR  register
  *             - 000100000: SVMCR1 register
  *             - 001000000: SVMCR2 register
  *             - 010000000: SVMCR3 register
  *             - 100000000: WKUPSR register
  * @{
  */
/* CR2 */
#define PWR_FLAG_PVDO                  (0x0028U)                               /*!< Programmable voltage detect output */

/* VOSCR */
#define PWR_FLAG_ACTVOSRDY             (0x0051U)                               /*!< Voltage levels ready bit                                 */
#define PWR_FLAG_ACTVOS                (0x0050U)                               /*!< Programmable voltage detect output                       */
#define PWR_FLAG_VOSRDY                (0x0041U)                               /*!< VOS Ready bit for VCORE voltage scaling output selection */

/* CR3 */
#define PWR_FLAG_VCOREH                (0x0089U)                               /*!< VDDCORE level monitoring versus high threshold */
#define PWR_FLAG_VCOREL                (0x0088U)                               /*!< VDDCORE level monitoring versus low threshold  */

/* BDCR1 */
#define PWR_FLAG_TEMPH                 (0x0113U)                               /*!< Temperature level monitoring versus high threshold */
#define PWR_FLAG_TEMPL                 (0x0112U)                               /*!< Temperature level monitoring versus low threshold  */
#define PWR_FLAG_VBATH                 (0x0111U)                               /*!< VBAT level monitoring versus high threshold        */
#define PWR_FLAG_VBATL                 (0x0110U)                               /*!< VBAT level monitoring versus low threshold         */

/* CPUCR */
#define PWR_FLAG_SBF                   (0x0209U)                               /*!< System Standby flag */
#define PWR_FLAG_STOPF                 (0x0208U)                               /*!< System Stop flag    */

/* SVMCR1 */
#define PWR_FLAG_VDDIO4RDY             (0x0410U)                               /*!< VDDIO4 ready  */


