micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr.h
/* SVMCR2 */
#define PWR_FLAG_VDDIO5RDY             (0x0810U)                               /*!< VDDIO5 ready  */

/* SVMCR3 */
#define PWR_FLAG_ARDY                  (0x1014U)                               /*!< VDDA18ADC ready */
#define PWR_FLAG_USB33RDY              (0x1012U)                               /*!< VDD33USB ready  */
#define PWR_FLAG_VDDIO3RDY             (0x1011U)                               /*!< VDDIO3 ready    */
#define PWR_FLAG_VDDIO2RDY             (0x1010U)                               /*!< VDDIO2 ready    */

/* WKUPSR */
#define PWR_FLAG_WKUPF4                (0x2004U)                               /*!< Wakeup event on wakeup pin 4 */
#define PWR_FLAG_WKUPF3                (0x2003U)                               /*!< Wakeup event on wakeup pin 3 */
#define PWR_FLAG_WKUPF2                (0x2002U)                               /*!< Wakeup event on wakeup pin 2 */
#define PWR_FLAG_WKUPF1                (0x2001U)                               /*!< Wakeup event on wakeup pin 1 */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_Exported_Macro PWR Exported Macro
  * @{
  */

/** @brief  Check whether or not a specific PWR flag is set.
  * @param  __FLAG__ specifies the flag to check.
  *           This parameter can be one of the following values:
  *          @arg PWR_FLAG_PVDO:      This flag is valid only if PVD
  *                                   is enabled by the HAL_PWR_EnablePVD()function.
  *                                   The PVD is stopped by STANDBY mode.
  *          @arg PWR_FLAG_ACTVOSRDY: This flag indicates that the regulator voltage
  *                                   scaling output selection is ready.
  *          @arg PWR_FLAG_ACTVOS:    This flag indicates that the regulator voltage
  *                                   scaling output selection is ready.
  *          @arg PWR_FLAG_VOSRDY     When an internal regulator is used, this bit indicates
  *                                   that all the features allowed by the selected VOS can be used.
  *          @arg PWR_FLAG_VCOREH:    This flag indicates if the VDDCORE level is above
  *                                   the high monitoring threshold.
  *          @arg PWR_FLAG_VCOREL     This flag indicates if the VDDCORE level is above
  *                                   the low monitoring threshold.
  *          @arg PWR_FLAG_TEMPH:     This flag indicates if the temperature level is above
  *                                   the high monitoring threshold.
  *          @arg PWR_FLAG_TEMPL      This flag indicates if the temperature level is above
  *                                   the low monitoring threshold.
  *          @arg PWR_FLAG_VBATH:     This flag indicates if the VBAT level is above
  *                                   the high monitoring threshold.
  *          @arg PWR_FLAG_VBATL:     This flag indicates if the VBAT level is above
  *                                   the low monitoring threshold.
  *          @arg PWR_FLAG_SBF:       Standby mode flag.
  *          @arg PWR_FLAG_STOPF:     STOP mode flag.
  *          @arg PWR_FLAG_VDDIO5RDY: This flag indicates if the VDDIO5 is ready.
  *          @arg PWR_FLAG_VDDIO4RDY: This flag indicates if the VDDIO4 is ready.
  *          @arg PWR_FLAG_VDDIO3RDY: This flag indicates if the VDDIO3 is ready.
  *          @arg PWR_FLAG_VDDIO2RDY: This flag indicates if the VDDIO2 is ready.
  *          @arg PWR_FLAG_ARDY:      This flag indicates if the VDDA18ADC is ready.
  *          @arg PWR_FLAG_USB33RDY:  This flag indicates if the VDD33USB is ready.
  *          @arg PWR_FLAG_WUF1:      This flag indicates a wakeup event was
  *                                   received from WKUP1 pin.
  *          @arg PWR_FLAG_WUF2:      This flag indicates a wakeup event was
  *                                   received from WKUP2 pin.
  *          @arg PWR_FLAG_WUF3:      This flag indicates a wakeup event was
  *                                   received from WKUP3 pin.
  *          @arg PWR_FLAG_WUF4:      This flag indicates a wakeup event was
  *                                   received from WKUP4 pin.
  * @retval The (__FLAG__) state (TRUE or FALSE).
  */
#define __HAL_PWR_GET_FLAG(__FLAG__) ( \
                ((__FLAG__) == PWR_FLAG_PVDO)      ? ((PWR->CR2 & PWR_CR2_PVDO)            == PWR_CR2_PVDO)         : \
                ((__FLAG__) == PWR_FLAG_ACTVOSRDY) ? ((PWR->VOSCR & PWR_VOSCR_ACTVOSRDY)   == PWR_VOSCR_ACTVOSRDY)  : \
                ((__FLAG__) == PWR_FLAG_ACTVOS)    ? ((PWR->VOSCR & PWR_VOSCR_ACTVOS)      == PWR_VOSCR_ACTVOS)     : \
                ((__FLAG__) == PWR_FLAG_VOSRDY)    ? ((PWR->VOSCR & PWR_VOSCR_VOSRDY)      == PWR_VOSCR_VOSRDY)     : \
                ((__FLAG__) == PWR_FLAG_VCOREH)    ? ((PWR->CR3 & PWR_CR3_VCOREH)          == PWR_CR3_VCOREH)       : \
                ((__FLAG__) == PWR_FLAG_VCOREL)    ? ((PWR->CR3 & PWR_CR3_VCOREL)          == PWR_CR3_VCOREL)       : \
                ((__FLAG__) == PWR_FLAG_TEMPH)     ? ((PWR->BDCR1 & PWR_BDCR1_TEMPH)       == PWR_BDCR1_TEMPH)      : \
                ((__FLAG__) == PWR_FLAG_TEMPL)     ? ((PWR->BDCR1 & PWR_BDCR1_TEMPL)       == PWR_BDCR1_TEMPL)      : \
                ((__FLAG__) == PWR_FLAG_VBATH)     ? ((PWR->BDCR1 & PWR_BDCR1_VBATH)       == PWR_BDCR1_VBATH)      : \
                ((__FLAG__) == PWR_FLAG_VBATL)     ? ((PWR->BDCR1 & PWR_BDCR1_VBATL)       == PWR_BDCR1_VBATL)      : \
                ((__FLAG__) == PWR_FLAG_SBF)       ? ((PWR->CPUCR & PWR_CPUCR_SBF)         == PWR_CPUCR_SBF)        : \
                ((__FLAG__) == PWR_FLAG_STOPF)     ? ((PWR->CPUCR & PWR_CPUCR_STOPF)       == PWR_CPUCR_STOPF)      : \
                ((__FLAG__) == PWR_FLAG_VDDIO4RDY) ? ((PWR->SVMCR1 & PWR_SVMCR1_VDDIO4RDY) == PWR_SVMCR1_VDDIO4RDY) : \
                ((__FLAG__) == PWR_FLAG_VDDIO5RDY) ? ((PWR->SVMCR2 & PWR_SVMCR2_VDDIO5RDY) == PWR_SVMCR2_VDDIO5RDY) : \
                ((__FLAG__) == PWR_FLAG_ARDY)      ? ((PWR->SVMCR3 & PWR_SVMCR3_ARDY)      == PWR_SVMCR3_ARDY)      : \
                ((__FLAG__) == PWR_FLAG_USB33RDY)  ? ((PWR->SVMCR3 & PWR_SVMCR3_USB33RDY)  == PWR_SVMCR3_USB33RDY)  : \
                ((__FLAG__) == PWR_FLAG_VDDIO3RDY) ? ((PWR->SVMCR3 & PWR_SVMCR3_VDDIO3RDY) == PWR_SVMCR3_VDDIO3RDY) : \
                ((__FLAG__) == PWR_FLAG_VDDIO2RDY) ? ((PWR->SVMCR3 & PWR_SVMCR3_VDDIO2RDY) == PWR_SVMCR3_VDDIO2RDY) : \
                ((__FLAG__) == PWR_FLAG_WKUPF4)    ? ((PWR->WKUPSR & PWR_WKUPSR_WKUPF4)    == PWR_WKUPSR_WKUPF4)    : \
                ((__FLAG__) == PWR_FLAG_WKUPF3)    ? ((PWR->WKUPSR & PWR_WKUPSR_WKUPF3)    == PWR_WKUPSR_WKUPF3)    : \
                ((__FLAG__) == PWR_FLAG_WKUPF2)    ? ((PWR->WKUPSR & PWR_WKUPSR_WKUPF2)    == PWR_WKUPSR_WKUPF2)    : \
                ((__FLAG__) == PWR_FLAG_WKUPF1)    ? ((PWR->WKUPSR & PWR_WKUPSR_WKUPF1)    == PWR_WKUPSR_WKUPF1)    : \
                ((PWR->WKUPSR & PWR_WKUPSR_WKUPF4) == PWR_WKUPSR_WKUPF4))

/** @brief  Clear PWR flags.
  * @param  __FLAG__: specifies the flag to clear.
  *         This parameter can be one of the following values:
  *           @arg PWR_FLAG_STOPF  : Stop flag.
  *                                  Indicates that the device was resumed from Stop mode.
  *           @arg PWR_FLAG_SBF    : Standby flag.
  *                                  Indicates that the device was resumed from Standby mode.
  * @retval None.
  */
#define __HAL_PWR_CLEAR_FLAG(__FLAG__) ( \
                                        ((__FLAG__) == PWR_FLAG_STOPF)  ? (SET_BIT(PWR->CPUCR,   PWR_CPUCR_CSSF))   : \
                                        ((__FLAG__) == PWR_FLAG_SBF)    ? (SET_BIT(PWR->CPUCR,   PWR_CPUCR_CSSF))   : \
                                        (SET_BIT(PWR->CPUCR, PWR_CPUCR_CSSF)))

/** @brief  Check PWR wake up flags are set or not.
  * @param  __FLAG__: specifies the wake up flag to check.
  *           This parameter can be one of the following values:
  *            @arg PWR_FLAG_WKUP1 : This parameter gets Wake up line 1 flag.
  *            @arg PWR_FLAG_WKUP2 : This parameter gets Wake up line 2 flag.
  *            @arg PWR_FLAG_WKUP3 : This parameter gets Wake up line 3 flag.
  *            @arg PWR_FLAG_WKUP4 : This parameter gets Wake up line 4 flag.
  *            @arg PWR_FLAG_WKUP  : This parameter gets Wake up lines 1 to 4 flags.
  * @retval The (__FLAG__) state (TRUE or FALSE).
  */
#define __HAL_PWR_GET_WAKEUPFLAG(__FLAG__) ((PWR->WKUPFR & (__FLAG__)) ? 0U : 1U)

/** @brief  Clear CPU PWR wake up flags.
  * @param  __FLAG__ : Specifies the wake up flag to be cleared.
  *           This parameter can be one of the following values :
  *            @arg PWR_FLAG_WKUP1 : This parameter clears Wake up line 1 flag.
  *            @arg PWR_FLAG_WKUP2 : This parameter clears Wake up line 2 flag.
  *            @arg PWR_FLAG_WKUP3 : This parameter clears Wake up line 3 flag.
  *            @arg PWR_FLAG_WKUP4 : This parameter clears Wake up line 4 flag.
  *            @arg PWR_FLAG_WKUP  : This parameter clears Wake up lines 1 to 4 flags.
  * @retval None.
  */
#define __HAL_PWR_CLEAR_WAKEUPFLAG(__FLAG__) SET_BIT(PWR->WKUPCR, (__FLAG__))

/**
  * @brief  Enable the PVD Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Event Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Event Line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Disable the PVD Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Enable the PVD Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                    \
  {                                                     \
    __HAL_PWR_PVD_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_PVD_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0);

/**
  * @brief  Disable the PVD Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                     \
  {                                                      \
    __HAL_PWR_PVD_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_PVD_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0);

/**
  * @brief  Check whether or not the PVD EXTI interrupt Rising flag is set.
  * @retval EXTI PVD Line Status.
  */
#define __HAL_PWR_PVD_EXTI_GET_RISING_FLAG() (EXTI->RPR3 & PWR_EXTI_LINE_PVD)

/**
  * @brief  Check whether or not the PVD EXTI interrupt Falling flag is set.
  * @retval EXTI PVD Line Status.
  */
#define __HAL_PWR_PVD_EXTI_GET_FALLING_FLAG() (EXTI->FPR3 & PWR_EXTI_LINE_PVD)

/**
  * @brief  Clear the PVD EXTI interrupt Rising flag.
  * @retval None
  */
#define __HAL_PWR_PVD_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Clear the PVD EXTI interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_PVD_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVD)

/**
  * @brief  Generates a Software interrupt on PVD EXTI line.
  * @retval None.
  */
#define __HAL_PWR_PVD_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVD)
/**
  * @}
  */

