micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr.h
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup PWR_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_PVD_EXTI_Line PWR PVD EXTI Line
  * @{
  */
#define PWR_EXTI_LINE_PVD              EXTI_IMR3_IM66                          /*!< External interrupt line 66 connected to the PVD EXTI Line */
/**
  * @}
  */

/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/** @defgroup PWR_Private_Macros PWR Private Macros
  * @{
  */

/** @defgroup PWR_IS_PWR_Definitions PWR Private macros to check input parameters
  * @{
  */

/* Check PVD mode parameter */
#define IS_PWR_PVD_MODE(__MODE__) (((__MODE__) == PWR_PVD_MODE_IT_RISING)            ||\
                                   ((__MODE__) == PWR_PVD_MODE_IT_FALLING)           ||\
                                   ((__MODE__) == PWR_PVD_MODE_IT_RISING_FALLING)    ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_RISING)         ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_FALLING)        ||\
                                   ((__MODE__) == PWR_PVD_MODE_EVENT_RISING_FALLING) ||\
                                   ((__MODE__) == PWR_PVD_MODE_NORMAL))

/* Check Sleep mode entry parameter */
#define IS_PWR_SLEEP_ENTRY(__ENTRY__) (((__ENTRY__) == PWR_SLEEPENTRY_WFI) ||\
                                       ((__ENTRY__) == PWR_SLEEPENTRY_WFE) ||\
                                       ((__ENTRY__) == PWR_SLEEPENTRY_WFE_NO_EVT_CLEAR))

/* Check Stop mode mode entry parameter */
#define IS_PWR_STOP_ENTRY(__ENTRY__) (((__ENTRY__) == PWR_STOPENTRY_WFI) ||\
                                      ((__ENTRY__) == PWR_STOPENTRY_WFE) ||\
                                      ((__ENTRY__) == PWR_STOPENTRY_WFE_NO_EVT_CLEAR))

/* Check wake up pin parameter */
#define IS_PWR_WAKEUP_PIN(__PIN__) (((__PIN__) == PWR_WAKEUP_PIN1)      ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN2)      ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN3)      ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN4)      ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN1_HIGH) ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN2_HIGH) ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN3_HIGH) ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN4_HIGH) ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN1_LOW)  ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN2_LOW)  ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN3_LOW)  ||\
                                    ((__PIN__) == PWR_WAKEUP_PIN4_LOW))

/* Check wake up pin polarity parameter */
#define IS_PWR_WAKEUP_PIN_POLARITY(__POLARITY__) (((__POLARITY__) == PWR_PIN_POLARITY_HIGH) ||\
                                                  ((__POLARITY__) == PWR_PIN_POLARITY_LOW))

/* Check wake up pin pull configuration parameter */
#define IS_PWR_WAKEUP_PIN_PULL(__PULL__) (((__PULL__) == PWR_PIN_NO_PULL) ||\
                                          ((__PULL__) == PWR_PIN_PULL_UP) ||\
                                          ((__PULL__) == PWR_PIN_PULL_DOWN))

/* Check wake up flag parameter */
#define IS_PWR_WAKEUP_FLAG(__FLAG__) (((__FLAG__) == PWR_WAKEUP_FLAG1) ||\
                                      ((__FLAG__) == PWR_WAKEUP_FLAG2) ||\
                                      ((__FLAG__) == PWR_WAKEUP_FLAG3) ||\
                                      ((__FLAG__) == PWR_WAKEUP_FLAG4) ||\
                                      ((__FLAG__) == PWR_WAKEUP_FLAG_ALL))


/* PWR Secure/Privilege items check macro */
#define IS_PWR_ITEMS_ATTRIBUTES(__ITEM__) ((((__ITEM__) & (~PWR_ITEM_ALL)) == 0U) && ((__ITEM__) != 0U))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* PWR attribute check macro (Secure) */
#define IS_PWR_ATTRIBUTES(ATTRIBUTES) ((((~(((ATTRIBUTES)& \
                                             0xF0U) >> 4U)) & ((ATTRIBUTES) & 0x0FU)) == 0U) && \
                                       (((ATTRIBUTES) & 0xFFFFFFCCU) == 0U))
#else
/* PWR attribute check macro (NSecure) */
#define IS_PWR_ATTRIBUTES(ATTRIBUTES) (((ATTRIBUTES) == PWR_NSEC_NPRIV) || ((ATTRIBUTES) == PWR_NSEC_PRIV))
#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/**
  * @}
  */

/* Include PWR HAL Extended module */
#include "stm32n6xx_hal_pwr_ex.h"

/* Exported functions --------------------------------------------------------*/

/** @addtogroup PWR_Exported_Functions PWR Exported Functions
  * @{
  */

/** @addtogroup PWR_Exported_Functions_Group1 Initialization and De-Initialization Functions
  * @{
  */
/* Initialization and de-initialization functions *****************************/
void HAL_PWR_DeInit(void);
void HAL_PWR_EnableBkUpAccess(void);
void HAL_PWR_DisableBkUpAccess(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group2 Peripheral Control Functions
  * @{
  */
/* Peripheral Control Functions  **********************************************/
/* PVD configuration */
void HAL_PWR_ConfigPVD(const PWR_PVDTypeDef *pConfigPVD);
void HAL_PWR_EnablePVD(void);
void HAL_PWR_DisablePVD(void);

/* WakeUp pins configuration */
void              HAL_PWR_EnableWakeUpPin(uint32_t WakeUpPinPolarity);
void              HAL_PWR_DisableWakeUpPin(uint32_t WakeUpPinx);
uint32_t          HAL_PWR_GetWakeupFlag(uint32_t WakeUpFlag);
HAL_StatusTypeDef HAL_PWR_ClearWakeupFlag(uint32_t WakeUpFlag);

/* Low Power modes entry */
void HAL_PWR_EnterSTOPMode(uint32_t Regulator, uint8_t STOPEntry);
void HAL_PWR_EnterSLEEPMode(uint32_t Regulator, uint8_t SLEEPEntry);
void HAL_PWR_EnterSTANDBYMode(void);

/* Cortex System Control functions  *******************************************/
void HAL_PWR_EnableSleepOnExit(void);
void HAL_PWR_DisableSleepOnExit(void);
void HAL_PWR_EnableSEVOnPend(void);
void HAL_PWR_DisableSEVOnPend(void);

/* Interrupt handler functions ************************************************/
void HAL_PWR_PVD_Rising_Callback(void);
void HAL_PWR_PVD_Falling_Callback(void);
void HAL_PWR_WAKEUP_PIN_IRQHandler(void);
void HAL_PWR_WKUP1_Callback(void);
void HAL_PWR_WKUP2_Callback(void);
void HAL_PWR_WKUP3_Callback(void);
void HAL_PWR_WKUP4_Callback(void);
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group3
  * @{
  */
/* Privileges and security configuration functions ****************************/
void              HAL_PWR_ConfigAttributes(uint32_t Item, uint32_t Attributes);
HAL_StatusTypeDef HAL_PWR_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32N6xx_HAL_PWR_H */

